Revit 2027 API
BuiltInFailures.ExternalResourceReferenceFailures Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ExternalResourceReferenceFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExternalResourceReferenceFailures
Public NotInheritable Class ExternalResourceReferenceFailures
public ref class ExternalResourceReferenceFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalResourceReferenceFailures = class end
The BuiltInFailures.ExternalResourceReferenceFailures type exposes the following members.
Properties
Name | Description
ReferenceToLocalFile |  The External Resource refers to a local file that may not be available to workshared users.
Top
See Also
Reference
Autodesk.Revit.DB Namespace